# Pandas

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\madhu\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\madhu\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\madhu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\madhu\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\madhu\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np

In [5]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [10]:
## create a dataframe

df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["Row1","Row2","Row3","Row4","Row5"]
             ,columns=["Column1","Column2","Column3","Clumn4"])

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.head(3)

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11

In [13]:
df.tail(2)

      Column1  Column2  Column3  Clumn4
Row4       12       13       14      15
Row5       16       17       18      19

In [14]:
df.describe()

         Column1    Column2    Column3     Clumn4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [16]:
df[['Column1','Column2','Column3']]

      Column1  Column2  Column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14
Row5       16       17       18

In [19]:
type(df[['Column1']])

pandas.core.frame.DataFrame

In [20]:
df

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [21]:
df.loc[["Row1","Row3"]]

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row3        8        9       10      11

In [24]:
df.iloc[0:3,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In [25]:
df

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [28]:
df.iloc[2:4,1:3]

      Column2  Column3
Row3        9       10
Row4       13       14

In [29]:
np.nan # null value

nan

In [32]:
df=pd.DataFrame(data=[[1,np.nan,2],[1,3,4],[5,4,3]],index=["Row1","Row2","Row3"]
             ,columns=["Column1","Column2","Column3"])

In [33]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4
Row3        5      4.0        3

In [34]:
df.isnull()

      Column1  Column2  Column3
Row1    False     True    False
Row2    False    False    False
Row3    False    False    False

In [35]:
df.isnull().sum()

Column1    0
Column2    1
Column3    0
dtype: int64

In [37]:
df.isna().sum()

Column1    0
Column2    1
Column3    0
dtype: int64

In [38]:
type(np.nan)

float

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Row1 to Row3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  3 non-null      int64
 1   Column2  2 non-null      float64
 2   Column3  3 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 96.0+ bytes

In [42]:
df.size

9

In [43]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4
Row3        5      4.0        3

In [47]:
df["Column1"].value_counts()

1    2
5    1
Name: Column1, dtype: int64

In [49]:
df["Column1"].unique()

array([1, 5], dtype=int64)

In [50]:
df["Column1"].nunique()

2

In [54]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4
Row3        5      4.0        3

In [51]:
df.nunique()

Column1    2
Column2    2
Column3    3
dtype: int64

In [52]:
df.nunique(axis=0)

Column1    2
Column2    2
Column3    3
dtype: int64

In [53]:
df.nunique(axis=1)

Row1    2
Row2    3
Row3    3
dtype: int64

In [91]:
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["Row1","Row2","Row3","Row4","Row5"]
             ,columns=["Column1","Column2","Column3","Clumn4"])

In [92]:
df

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [93]:
df.head()

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [60]:
df[df["Column1"]>5]

      Column1  Column2  Column3  Clumn4
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [61]:
type(df["Column1"]>5)

pandas.core.series.Series

In [62]:
df[df.isnull()]

      Column1  Column2  Column3  Clumn4
Row1      NaN      NaN      NaN     NaN
Row2      NaN      NaN      NaN     NaN
Row3      NaN      NaN      NaN     NaN
Row4      NaN      NaN      NaN     NaN
Row5      NaN      NaN      NaN     NaN

In [90]:
df.head()

      col 1 col 2
row 1     a     b
row 2     c     d

In [70]:
df.to_csv('test.csv',index=False)

In [71]:
df1=pd.read_csv('test.csv')

In [72]:
df1

   Column1  Column2  Column3  Clumn4
0        0        1        2       3
1        4        5        6       7
2        8        9       10      11
3       12       13       14      15
4       16       17       18      19

In [73]:
df.to_excel('test.xlsx')

In [74]:
pd.read_excel('test.xlsx')

  Unnamed: 0  Column1  Column2  Column3  Clumn4
0       Row1        0        1        2       3
1       Row2        4        5        6       7
2       Row3        8        9       10      11
3       Row4       12       13       14      15
4       Row5       16       17       18      19

In [75]:
data='{"employee_name":"Krish","email":"krish@gmal.com","job_profile":[{"title":"Team Lead","role":"DEveloper"}]}'

In [76]:
type(data)

str

In [77]:
df2=pd.read_json(data)

In [78]:
df2

  employee_name           email                                  job_profile
0         Krish  krish@gmal.com  {'title': 'Team Lead', 'role': 'DEveloper'}

In [79]:
df2['salary']=1000
df2

,employee_name,email,job_profile,salary
0,Krish,krish@gmal.com,"{'title': 'Team Lead', 'role': 'DEveloper'}",1000

In [80]:
df2['job_profile']

0    {'title': 'Team Lead', 'role': 'DEveloper'}
Name: job_profile, dtype: object

In [82]:
dict(df2['job_profile'])[0]['role']

'DEveloper'

In [83]:
data

'{"employee_name":"Krish","email":"krish@gmal.com","job_profile":[{"title":"Team Lead","role":"DEveloper"}]}'

In [85]:
pd.read_json(data,orient='index')

                                                           0
employee_name                                          Krish
email                                         krish@gmal.com
job_profile    [{'title': 'Team Lead', 'role': 'DEveloper'}]

In [86]:
pd.read_json(data,orient='records')

  employee_name           email                                  job_profile
0         Krish  krish@gmal.com  {'title': 'Team Lead', 'role': 'DEveloper'}

In [87]:
pd.read_json(data,orient='columns')

  employee_name           email                                  job_profile
0         Krish  krish@gmal.com  {'title': 'Team Lead', 'role': 'DEveloper'}

In [88]:
df=pd.DataFrame([['a','b'],['c','d']],
               index=['row 1','row 2'],
               columns=['col 1','col 2'])

In [89]:
df

      col 1 col 2
row 1     a     b
row 2     c     d

In [94]:
df

      Column1  Column2  Column3  Clumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [95]:
df.to_json()

'{"Column1":{"Row1":0,"Row2":4,"Row3":8,"Row4":12,"Row5":16},"Column2":{"Row1":1,"Row2":5,"Row3":9,"Row4":13,"Row5":17},"Column3":{"Row1":2,"Row2":6,"Row3":10,"Row4":14,"Row5":18},"Clumn4":{"Row1":3,"Row2":7,"Row3":11,"Row4":15,"Row5":19}}'

In [96]:
df.to_json(orient='records')

'[{"Column1":0,"Column2":1,"Column3":2,"Clumn4":3},{"Column1":4,"Column2":5,"Column3":6,"Clumn4":7},{"Column1":8,"Column2":9,"Column3":10,"Clumn4":11},{"Column1":12,"Column2":13,"Column3":14,"Clumn4":15},{"Column1":16,"Column2":17,"Column3":18,"Clumn4":19}]'

In [97]:
df.to_json(orient='columns')

'{"Column1":{"Row1":0,"Row2":4,"Row3":8,"Row4":12,"Row5":16},"Column2":{"Row1":1,"Row2":5,"Row3":9,"Row4":13,"Row5":17},"Column3":{"Row1":2,"Row2":6,"Row3":10,"Row4":14,"Row5":18},"Clumn4":{"Row1":3,"Row2":7,"Row3":11,"Row4":15,"Row5":19}}'